<?php
require('src/functions.php');

//Функция должна принимать массив строк и выводить каждую строку в отдельном параграфе
//Если в функцию передан второй параметр true, то возвращать (через return) результат в виде одной объединенной строки.
echo '<h1>'.'Задание 1'.'</h1>';
$arr = array('1','2','3','4','5',);
echo task1($arr, TRUE);
echo task1($arr, FALSE);

//Функция должна принимать переменное число аргументов.
//Первым аргументом обязательно должна быть строка, обозначающая арифметическое действие, которое необходимо выполнить со всеми передаваемыми аргументами.
echo '<h1>'.'Задание 2'.'</h1>';
echo task2('+',1,2,3,4).'<br>';
echo task2('-',1,2,3,4).'<br>';
echo task2('*',1,2,3,4).'<br>';
echo task2('/',1,2,3,4).'<br>';
echo task2('/',1,0,3,4).'<br>';

//Функция должна принимать два параметра – целые числа.
//Если в функцию передали 2 целых числа, то функция должна отобразить таблицу умножения размером со значения параметров
echo '<h1>'.'Задание 3'.'</h1>';
task3(3,3);
task3(1,'test');

//Выведите информацию о текущей дате в формате 31.12.2016 23:59
//Выведите unixtime время соответствующее 24.02.2016 00:00:00.
echo '<h1>'.'Задание 4'.'</h1>';
task4();

//Дана строка: “Карл у Клары украл Кораллы”. Удалить из этой строки все заглавные буквы “К”.
//Дана строка: “Две бутылки лимонада”. Заменить “Две”, на “Три”.
echo '<h1>'.'Задание 5'.'</h1>';
task5();

//Дана строка: “Карл у Клары украл Кораллы”. Удалить из этой строки все заглавные буквы “К”.
//Дана строка: “Две бутылки лимонада”. Заменить “Две”, на “Три”.
echo '<h1>'.'Задание 6'.'</h1>';
task6();